
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные1 = Элементы.СписокНоменклатуры.ТекущиеДанные;
	
	ПересчетСуммыВТекущейСтроке(ТекущиеДанные1);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	
	ПересчетСуммыВТекущейСтроке(ТекущиеДанные);
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
 
// Пересчет суммы в текущей строке.
// 
// Параметры:
//  ТекущиеДанные ДанныеФормыЭлементКоллекции
&НаКлиенте
Процедура ПересчетСуммыВТекущейСтроке(ТекущиеДанные)
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	
	
КонецПроцедуры

#КонецОбласти